[
  {
    "id": "1",
    "company": "Fetch Rewards",
    "role": "Software Engineer III",
    "duration": "September 2021 - August 2025",
    "description": "• Built backend services from the ground up with Golang and Python to integrate OCR and LLM models to digitize receipt data, replacing the legacy receipt text recognition system, delivering over $6M in annual cost savings and 30% user growth over 4 years.\n\n• Led the end-to-end lifecycle of new microservices, partnering with frontend and data quality teams to ensure seamless integration and accuracy, reducing data correction time by 40%.\n\n• Implemented SNS and SQS to build an event-driven architecture that triggers Lambda-based workflows for automated model experiments.\n\n• Spearheaded the adoption of AWS services S3 Express One Zone by evaluating pros and cons, conducting thorough investigations, and driving innovation through well-informed experimentation.",
    "technologies": ["Go", "Python", "AWS", "LLM", "Docker"]
  },
  {
    "id": "2",
    "company": "Quanta Computer",
    "role": "Software Engineer",
    "duration": "September 2020 - September 2021",
    "description": "• Led a team of 5 engineers and QA specialists in deploying automation systems, ensuring scalable and high-quality production environments.\n\n• Designed and implemented Python automation scripts and custom monitoring dashboards to support IoT devices, reducing manual errors by 30% and increasing throughput by 25% within six months.\n\n• Collaborated with customers to deliver timely technical support, continuously enhancing system scalability and reliability to meet evolving user needs.",
    "technologies": ["Python", "QA", "Leadership", "Customer Support"]
  },
  {
    "id": "3",
    "company": "Relaymile",
    "role": "Software Engineer Intern",
    "duration": "Feburary 2021 - April 2021",
    "description": "• Developed Python/Flask backend services to optimize truck route planning, improving load management and operational efficiency for drivers.\n\n• Implemented React frontend pages integrated with backend APIs, leveraging SQLAlchemy ORM for efficient data retrieval.\n\n • Integrated automated unit testing frameworks into the CI/CD pipeline, achieving 85%+ test coverage and reducing release cycle bottlenecks, enabling the team to ship features 30% faster with fewer regressions.",
    "technologies": ["Python", "Flask", "React", "CI/CD"]
  },
  {
    "id": "4",
    "company": "I/O Controls Corporation",
    "role": "Software Engineer Intern",
    "duration": "May 2020 - June 2020",
    "description": "• Collaborated with the software engineering team to design and implement scalable notification services supporting over 2,000 users in the LA area using Node.js.\n\n• Developed a robust Mocha unit testing template, improving bug detection and maintaining code quality across five core services\n\n• Built an Angular-based frontend GUI that streamlined employee workflows and reduced analysis workload\n\n• Integrated REST API endpoints to enable secure, real-time communication between embedded controllers and server applications, increasing system reliability and facilitating cross-platform interactions",
    "technologies": ["HTML", "CSS", "Angular", "Node.js", "JavaScript", "MySQL"]
  },
  {
    "id": "5",
    "company": "Siacin Intl. Co. Ltd.",
    "role": "Mechanical Engineer",
    "duration": "November 2016 - March 2018",
    "description": "Worked independently on mechanical machines design. Closed the most crucial project in company history by developing the storage tower system that generate 15% revenue in the fiscal year.",
    "technologies": ["AutoCAD", "Inventor", "Mechanical Design"]
  }
]
